app/controllers/classified_listings_controller.rb

  def index
    @classified_listings = ClassifiedListing.all
---
SELECT `classified_listings`.* FROM `classified_listings`

  def show
    @classified_listing = ClassifiedListing.find(params[:id])
---
SELECT `classified_listings`.* FROM `classified_listings` WHERE `classified_listings`.`id` = 1 LIMIT 1

  def edit
    @classified_listing = ClassifiedListing.find(params[:id])
---
SELECT `classified_listings`.* FROM `classified_listings` WHERE `classified_listings`.`id` = 1 LIMIT 1

  def create
    @classified_listing = ClassifiedListing.new(params[:classified_listing])

    respond_to do |format|
      if @classified_listing.save
---
INSERT INTO `classified_listings` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('I am selling my apartment!', '2012-11-29 18:13:20', 'appt', 'Rent My Appartment!', '2012-11-29 18:13:20')

  def destroy
    @classified_listing = ClassifiedListing.find(params[:id])
    @classified_listing.destroy
---
SELECT `classified_listings`.* FROM `classified_listings` WHERE `classified_listings`.`id` = 2 LIMIT 1
DELETE FROM `classified_listings` WHERE `classified_listings`.`id` = 2