app/controllers/home_controller.rb

SELECT `classified_listings`.* FROM `classified_listings`
---
  def index
  	@classified_listings = ClassifiedListing.all