app/controllers/parties_controller.rb

SELECT `parties`.* FROM `parties`
---
  def index
  	@parties = Party.plusminus_tally.limit(10)

SELECT `parties`.* FROM `parties` WHERE `parties`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`
---
  def vote
    party = Party.find(params[:id])
    vote = ""
    if params[:vote] == "up"
      User.all[0].vote_exclusively_for(party)