app/controllers/ride_posts_controller.rb

SELECT `ride_posts`.* FROM `ride_posts`
---
  def index
    @ride_posts = RidePost.all